; domain
(define (domain joint_teleport-assistance6_domain)
(:requirements :typing :action-costs)

(:types
    place telstatus - object
)

(:constants
    origin destination disabled - telstatus
)

(:predicates
    (prime_turn)
    (supporter_turn)
    (at-prime ?p -  place)
    (at-teleport ?p - place ?s -  telstatus)
    (teleport_origin_can_be_activated)
    (teleport_destination_can_be_activated)
    (adj-walk ?p1 - place ?p2 -  place)
)

(:functions
    (total-cost) - number
)

(:action sup_activate-teleport-origin
    :parameters (?pos - place)
    :precondition (and
        (supporter_turn)
        (teleport_origin_can_be_activated)
        (at-teleport ?pos disabled)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-teleport ?pos origin)
        (not (teleport_origin_can_be_activated))
        (not (at-teleport ?pos disabled))
        (increase (total-cost) 1.0)
    )
)

(:action sup_activate-teleport-destination
    :parameters (?pos - place)
    :precondition (and
        (supporter_turn)
        (teleport_destination_can_be_activated)
        (at-teleport ?pos disabled)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-teleport ?pos destination)
        (not (teleport_destination_can_be_activated))
        (not (at-teleport ?pos disabled))
        (increase (total-cost) 1.0)
    )
)

(:action sup_use-teleport
    :parameters (?pos1 ?pos2 - place)
    :precondition (and
        (supporter_turn)
        (at-prime ?pos1)
        (at-teleport ?pos1 origin)
        (at-teleport ?pos2 destination)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (at-prime ?pos2)
        (not (at-prime ?pos1))
        (increase (total-cost) 1.0)
    )
)

(:action pri_walk
    :parameters (?from - place ?to - place)
    :precondition (and
        (prime_turn)
        (adj-walk ?from ?to)
        (at-prime ?from)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-prime ?to)
        (not (at-prime ?from))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_noop
    :parameters ()
    :precondition (and
        (prime_turn)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (increase (total-cost) 0)
    )
)

(:action sup_noop
    :parameters ()
    :precondition (and
        (supporter_turn)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (increase (total-cost) 0)
    )
)

)

; problem
(define (problem joint_teleport-assistance6_problem_83)
(:domain joint_teleport-assistance6_domain)
(:objects
    pos3-6 pos3-8 pos4-7 pos4-8 pos5-4 pos5-5 pos5-6 pos5-7 pos5-8 pos6-0 pos6-1 pos6-2 pos6-3 pos6-4 pos6-5 pos6-6 pos6-7 pos6-8 pos7-5 pos7-7 pos7-8 pos8-2 pos8-4 pos8-5 pos8-6 pos8-7 pos8-8 pos9-0 pos9-5 pos9-6 pos9-7 pos9-8 - place
)

(:init
    (= (total-cost) 0)
    (supporter_turn)
    (at-teleport pos6-1 disabled)
    (at-teleport pos6-6 disabled)
    (at-teleport pos6-7 disabled)
    (at-teleport pos4-8 disabled)
    (at-teleport pos7-5 disabled)
    (teleport_origin_can_be_activated)
    (teleport_destination_can_be_activated)
    (at-prime pos6-0)
    (adj-walk pos3-8 pos4-8)
    (adj-walk pos4-8 pos3-8)
    (adj-walk pos4-7 pos4-8)
    (adj-walk pos4-8 pos4-7)
    (adj-walk pos4-7 pos5-7)
    (adj-walk pos5-7 pos4-7)
    (adj-walk pos4-8 pos5-8)
    (adj-walk pos5-8 pos4-8)
    (adj-walk pos5-4 pos5-5)
    (adj-walk pos5-5 pos5-4)
    (adj-walk pos5-4 pos6-4)
    (adj-walk pos6-4 pos5-4)
    (adj-walk pos5-5 pos5-6)
    (adj-walk pos5-6 pos5-5)
    (adj-walk pos5-5 pos6-5)
    (adj-walk pos6-5 pos5-5)
    (adj-walk pos5-6 pos5-7)
    (adj-walk pos5-7 pos5-6)
    (adj-walk pos5-6 pos6-6)
    (adj-walk pos6-6 pos5-6)
    (adj-walk pos5-7 pos5-8)
    (adj-walk pos5-8 pos5-7)
    (adj-walk pos5-7 pos6-7)
    (adj-walk pos6-7 pos5-7)
    (adj-walk pos5-8 pos6-8)
    (adj-walk pos6-8 pos5-8)
    (adj-walk pos6-0 pos6-1)
    (adj-walk pos6-1 pos6-0)
    (adj-walk pos6-1 pos6-2)
    (adj-walk pos6-2 pos6-1)
    (adj-walk pos6-2 pos6-3)
    (adj-walk pos6-3 pos6-2)
    (adj-walk pos6-3 pos6-4)
    (adj-walk pos6-4 pos6-3)
    (adj-walk pos6-4 pos6-5)
    (adj-walk pos6-5 pos6-4)
    (adj-walk pos6-5 pos6-6)
    (adj-walk pos6-6 pos6-5)
    (adj-walk pos6-5 pos7-5)
    (adj-walk pos7-5 pos6-5)
    (adj-walk pos6-6 pos6-7)
    (adj-walk pos6-7 pos6-6)
    (adj-walk pos6-7 pos6-8)
    (adj-walk pos6-8 pos6-7)
    (adj-walk pos6-7 pos7-7)
    (adj-walk pos7-7 pos6-7)
    (adj-walk pos6-8 pos7-8)
    (adj-walk pos7-8 pos6-8)
    (adj-walk pos7-5 pos8-5)
    (adj-walk pos8-5 pos7-5)
    (adj-walk pos7-7 pos7-8)
    (adj-walk pos7-8 pos7-7)
    (adj-walk pos7-7 pos8-7)
    (adj-walk pos8-7 pos7-7)
    (adj-walk pos7-8 pos8-8)
    (adj-walk pos8-8 pos7-8)
    (adj-walk pos8-4 pos8-5)
    (adj-walk pos8-5 pos8-4)
    (adj-walk pos8-5 pos8-6)
    (adj-walk pos8-6 pos8-5)
    (adj-walk pos8-5 pos9-5)
    (adj-walk pos9-5 pos8-5)
    (adj-walk pos8-6 pos8-7)
    (adj-walk pos8-7 pos8-6)
    (adj-walk pos8-6 pos9-6)
    (adj-walk pos9-6 pos8-6)
    (adj-walk pos8-7 pos8-8)
    (adj-walk pos8-8 pos8-7)
    (adj-walk pos8-7 pos9-7)
    (adj-walk pos9-7 pos8-7)
    (adj-walk pos8-8 pos9-8)
    (adj-walk pos9-8 pos8-8)
    (adj-walk pos9-5 pos9-6)
    (adj-walk pos9-6 pos9-5)
    (adj-walk pos9-6 pos9-7)
    (adj-walk pos9-7 pos9-6)
    (adj-walk pos9-7 pos9-8)
    (adj-walk pos9-8 pos9-7)
)

(:goal
  (and
    (at-prime pos8-8)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (sup_activate-teleport-destination pos6-7)
   deleted: (supporter_turn) (teleport_destination_can_be_activated) (at-teleport pos6-7 disabled)
   added: (prime_turn) (at-teleport pos6-7 destination)
   goals met: 0 of 1
2. (pri_walk pos6-0 pos6-1)
   deleted: (prime_turn) (at-prime pos6-0)
   added: (supporter_turn) (at-prime pos6-1)
   goals met: 0 of 1
3. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
4. (pri_walk pos6-1 pos6-2)
   deleted: (prime_turn) (at-prime pos6-1)
   added: (supporter_turn) (at-prime pos6-2)
   goals met: 0 of 1
5. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
6. (pri_walk pos6-2 pos6-3)
   deleted: (prime_turn) (at-prime pos6-2)
   added: (supporter_turn) (at-prime pos6-3)
   goals met: 0 of 1
7. (sup_activate-teleport-origin pos6-6)
   deleted: (supporter_turn) (teleport_origin_can_be_activated) (at-teleport pos6-6 disabled)
   added: (prime_turn) (at-teleport pos6-6 origin)
   goals met: 0 of 1
8. (pri_walk pos6-3 pos6-4)
   deleted: (prime_turn) (at-prime pos6-3)
   added: (supporter_turn) (at-prime pos6-4)
   goals met: 0 of 1
9. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
10. (pri_walk pos6-4 pos6-5)
   deleted: (prime_turn) (at-prime pos6-4)
   added: (supporter_turn) (at-prime pos6-5)
   goals met: 0 of 1
11. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
12. (pri_walk pos6-5 pos6-6)
   deleted: (prime_turn) (at-prime pos6-5)
   added: (supporter_turn) (at-prime pos6-6)
   goals met: 0 of 1
13. (sup_use-teleport pos6-6 pos6-7)
   deleted: (supporter_turn) (at-prime pos6-6)
   added: (prime_turn) (at-prime pos6-7)
   goals met: 0 of 1
14. (pri_walk pos6-7 pos6-8)
   deleted: (prime_turn) (at-prime pos6-7)
   added: (supporter_turn) (at-prime pos6-8)
   goals met: 0 of 1
15. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
16. (pri_walk pos6-8 pos7-8)
   deleted: (prime_turn) (at-prime pos6-8)
   added: (supporter_turn) (at-prime pos7-8)
   goals met: 0 of 1
17. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 0 of 1
18. (pri_walk pos7-8 pos8-8)
   deleted: (prime_turn) (at-prime pos7-8)
   added: (supporter_turn) (at-prime pos8-8)
   goals met: 1 of 1
